app/controllers/movies_controller.rb

  def index
    @movies = Movie.all.order("created_at DESC")
---
SELECT "movies".* FROM "movies" ORDER BY created_at DESC

  def create
    @movie = Movie.new(movie_params)

    if @movie.save
---
INSERT INTO "movies" ("title", "description", "director", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "cos"], ["description", "cos"], ["director", "cos"], ["created_at", 2017-03-19 18:36:16 UTC], ["updated_at", 2017-03-19 18:36:16 UTC], ["user_id", 2]]

  def update
    if @movie.update(movie_params)
---
UPDATE "movies" SET "title" = ?, "description" = ?, "director" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", "2121"], ["description", "2121"], ["director", "2121"], ["updated_at", 2017-03-19 18:02:11 UTC], ["id", 5]]

  def destroy
    @movie.destroy
---
DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 1]]

    def find_movie
      @movie = Movie.find(params[:id])
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]